{
  "results": [{
    "id": "sensorly-apps",
    "type": "apps before",
    "size": "col-lg-4 col-md-6",
    "index": 1,
    "title": "Sensorly Apps",
    "content": "We acquired Sensorly in late 2016. User testing revealed a number of usability problems. Naming conventions changed from screen to screen. Design elements such as buttons, toggles, fonts, and colors were also very inconsistent within the app, as well as from the website.\n\nThe team decided to tackle the iOS app first since it had a smaller user base. Initial testing involved 3 iOS users. After the initial testing I took those results to inform my first design. Then, I did some A/B testing with the current iOS app against the new design. Testing involved nine different users. Testing was done in rotating order. \n\nTesting overall largely favored the new design, however some new usability problems were revealed. More informal testing, and re-design iteratively followed until the design below was reached. The android re-design followed informed greatly by the first re-design.",
    "image": "/static/images/sensorly-apps.png",
    "portImgs": ["Most users liked the home screen because it gave them a quick idea of what the app had to offer right away. Most only used it once or twice as navigation, and then started using the bottom tab bars. However, repeating navigation is usually a bad idea. It can undermine the chosen method of navigation, delay users from getting to the more important content, and can create more work to maintain two sets of navigation. The solution was to remove the home screen and create a few onboarding screens. The onboarding screens go through the main functionality of the app in more detail than the home screen, but are only shown once as to not keep users from the more important content.", "/static/images/port-sen-home.jpg", "/static/images/port-sen-onboarding.jpg", "The team wanted to add the Map Trip feature to the iOS app, since it had become popular in the Android version. In order to make room in the bottom tab bar, I combined the Coverage Maps & Speedtest Maps into one Map. Not only did this save valuable tab space and increase simplicity, but it also was a more common user interface pattern.", "/static/images/port-sen-map2.jpg", "/static/images/port-sen-map.jpg", "Testing revealed that choosing a network was cumbersome and made it difficult to quickly toggle between different carriers. Users had to first select a country, then a network on a completely different screen. All 9 testers preferred having the network list in the bottom panel, so they could see the map at the same time they chose their network. Instead of having the user select their country, all networks are based on the viewport location. This solution significantly reduced the time it took to select a network.", "/static/images/port-sen-map-closed2.jpg", "/static/images/port-sen-map-closed.jpg", "On both the original maps, users were confused at first as to what the different colored dots, and shapes stood for. Most found the legend in the Caption dropdown but usually after some difficulty. The lack of labeling on the up and down arrows also caused some mild confusion. The legend is now always visible when the network list is closed, and both arrows are now labeled.", "/static/images/port-sen-speed-test2.jpg", "/static/images/port-sen-speed-test.jpg", "Testing revealed some of the fonts were difficult to read and there was confusion as to what network they were testing until the test was complete. This became a real issue with users who had limited data plans and weren’t aware that testing their mobile network could use a significant amount of data. The solution has more readable fonts, displays the network before the testing begins, and has a more modern and simple design.", "/static/images/port-sen-speed-test-done2.jpg", "/static/images/port-sen-speed-test-done.jpg", "As with the previous screen fonts were sometimes too small and hard to read. The app also had three or four different styles of buttons, and inconsistent naming conventions. The solution remedied these issues as well as updating the design and simplifying the interface.", "/static/images/port-sen-map-speed2.jpg", "/static/images/port-sen-map-speed.jpg", "The original Activity screen wasn’t very scannable. Users could only see about three or four tests at a time. The fonts were also sometimes too small and hard to read. The solution can show up to 9 different tests or trips at a time, users are able to much more easily scan the results, what network was tested, when it was taken, and if it was a Speed Test or a Trip.", "/static/images/port-sen-activity2.jpg", "/static/images/port-sen-activity.jpg"],
    "videosrcs": ["/static/video/android-map", "/static/video/map-trip", "/static/video/speedtest"],
    "product": "iOS and Android Apps",
    "date": "iPhone: August 3rd 2016 </br> Android: April 21st 2018",
    "role": "Sole UI/UX designer and helped with some minor app development for both apps."
  }]
}
